In [66]:
import pandas as pd

In [2]:
jan_df = pd.read_csv('data/Jan Sold With.csv')
nov_df = pd.read_csv('data/Nov Sold With.csv')
dec_df = pd.read_csv('data/Dec Sold With.csv')
stores_df = pd.read_csv('data/stores.csv')
store_sales_df = pd.read_csv('data/Store Sales.csv')
products_df = pd.read_csv('data/products.csv')

C:\Users\alecb\AppData\Local\Temp\ipykernel_92292\1282520034.py:1: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  jan_df = pd.read_csv('data/Jan Sold With.csv')
C:\Users\alecb\AppData\Local\Temp\ipykernel_92292\1282520034.py:2: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  nov_df = pd.read_csv('data/Nov Sold With.csv')
C:\Users\alecb\AppData\Local\Temp\ipykernel_92292\1282520034.py:3: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  dec_df = pd.read_csv('data/Dec Sold With.csv')

In [3]:
print(jan_df.shape)
jan_df.head()

(493736, 17)

,DIV,STORE,TRANSACTION_DATE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_EMP_IND,PRIMARY_SOS_IND,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_EMP_IND,SECONDARY_SOS_IND,SECONDARY_UNITS,PRIMARY_LINENO,SECONDARY_LINENO
0,8,11,13-JAN-23,860448,070,M,N,N,1,1802406,060,M,N,N,1,1,2
1,8,11,13-JAN-23,1802406,060,M,N,N,1,860448,070,M,N,N,1,2,1
2,8,11,13-JAN-23,497795,045,M,N,N,1,3323,NaN,NaN,N,N,3,1,3
3,8,11,13-JAN-23,581620,080,M,N,N,1,2577,NaN,NaN,N,N,3,1,2
4,8,11,13-JAN-23,581620,080,M,N,N,1,53080,M,NaN,N,N,1,1,3

In [4]:
print(nov_df.shape)
nov_df.head()

(928681, 17)

,DIV,STORE,TRANSACTION_DATE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_EMP_IND,PRIMARY_SOS_IND,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_EMP_IND,SECONDARY_SOS_IND,SECONDARY_UNITS,PRIMARY_LINENO,SECONDARY_LINENO
0,8,12,02-NOV-22,99497860,080,M,N,Y,1,497403,060,M,N,N,1,1,3
1,8,12,02-NOV-22,497403,060,M,N,N,1,99497860,080,M,N,Y,1,3,1
2,8,12,03-NOV-22,398562,100,M,N,N,1,19133,XL,NaN,N,N,1,2,1
3,8,12,03-NOV-22,1497835,130,M,N,N,1,398564,070,M,N,N,1,1,2
4,8,12,03-NOV-22,1497835,130,M,N,N,1,398564,060,M,N,N,1,1,3

In [5]:
print(dec_df.info())
print(dec_df.shape)
dec_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1685451 entries, 0 to 1685450
Data columns (total 17 columns):
 #   Column                Non-Null Count    Dtype
---  ------                --------------    -----
 0   DIV                   1685451 non-null  int64
 1   STORE                 1685451 non-null  int64
 2   TRANSACTION_DATE      1685451 non-null  object
 3   PRIMARY_STOCKNO       1685451 non-null  int64
 4   PRIMARY_ITEM_SIZE     1685451 non-null  object
 5   PRIMARY_ITEM_WIDTH    1684624 non-null  object
 6   PRIMARY_EMP_IND       1685451 non-null  object
 7   PRIMARY_SOS_IND       1685451 non-null  object
 8   PRIMARY_UNITS         1685451 non-null  int64
 9   SECONDARY_STOCKNO     1685451 non-null  int64
 10  SECONDARY_ITEM_SIZE   1054393 non-null  object
 11  SECONDARY_ITEM_WIDTH  983880 non-null   object
 12  SECONDARY_EMP_IND     1685451 non-null  object
 13  SECONDARY_SOS_IND     1685451 non-null  object
 14  SECONDARY_UNITS       1685451 non-null  int64
 15  PRIMARY_LINENO        1685451 non-null  int64
 16  SECONDARY_LINENO      1685451 non-null  int64
dtypes: int64(8), object(9)
memory usage: 218.6+ MB
None
(1685451, 17)

,DIV,STORE,TRANSACTION_DATE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_EMP_IND,PRIMARY_SOS_IND,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_EMP_IND,SECONDARY_SOS_IND,SECONDARY_UNITS,PRIMARY_LINENO,SECONDARY_LINENO
0,8,11,16-DEC-22,399773,80,M,N,N,1,3970,NaN,NaN,N,N,6,1,2
1,8,11,16-DEC-22,480990,105,M,N,N,1,2745,NaN,NaN,N,N,5,1,2
2,8,11,16-DEC-22,398572,50,M,N,N,1,398274,050,M,N,N,1,1,2
3,8,11,16-DEC-22,398572,50,M,N,N,1,399763,100,M,N,N,1,1,3
4,8,11,16-DEC-22,398274,50,M,N,N,1,398572,050,M,N,N,1,2,1

In [6]:
dec_df.TRANSACTION_DATE.value_counts()

23-DEC-22    159320
17-DEC-22    124125
22-DEC-22    114202
24-DEC-22    109170
21-DEC-22     92438
18-DEC-22     90188
10-DEC-22     84120
20-DEC-22     78342
16-DEC-22     74778
19-DEC-22     69970
11-DEC-22     58562
03-DEC-22     58146
15-DEC-22     50684
09-DEC-22     48362
04-DEC-22     43241
14-DEC-22     41093
12-DEC-22     35843
13-DEC-22     34728
02-DEC-22     34340
26-DEC-22     33342
30-DEC-22     31020
08-DEC-22     29931
31-DEC-22     28301
07-DEC-22     26444
05-DEC-22     23492
29-DEC-22     23112
06-DEC-22     23037
01-DEC-22     22505
27-DEC-22     21391
28-DEC-22     21224
Name: TRANSACTION_DATE, dtype: int64

In [7]:
print(stores_df.shape)
stores_df.head()

(1055, 16)

,DIV,STORE,DIV_ORG,DIV_ORG_NAME,REGION,DISTRICT,STORE_NAME,STORE_CITY,STORE_STATE_ALPHA,STORE_ZIP,GROSS_FEET,MALL_GRADE,LOCATION_GRADE,MALL_NAME,LATITUDE,LONGITUDE
0,8,11,1,JYUG,8,15,UNDERGROUND #11 15,PENSACOLA,FL,325048753,1740.0,B+,B,CORDOVA MALL,30.4873,-87.1922
1,8,12,1,JYUG,9,29,UNDERGROUND #12 29,STERLING HEIGHTS,MI,483131320,1600.0,D,A,LAKESIDE MALL,42.6019,-82.9980
2,8,13,1,JYUG,2,7,UNDERGROUND #13 07,LOUISVILLE,KY,402073342,1616.0,B+,B,MALL ST. MATTHEWS,38.2557,-85.6472
3,8,17,1,JYUG,3,73,UNDERGROUND #17 73,MIAMI,FL,331891221,1552.0,B,A,SOUTHLAND MALL,25.5744,-80.3471
4,8,23,1,JYUG,11,13,UNDERGROUND #23 13,MOBILE,AL,366066693,1998.0,B,B,COLONIAL MALL,30.6732,-88.1041

In [8]:
stores_df.STORE_NAME.unique()

array(['UNDERGROUND #11 15', 'UNDERGROUND #12 29', 'UNDERGROUND #13 07',
       ..., 'JOURNEYS KIDZ #7215 32 OP', 'JOURNEYS KIDZ #7216 40 OP',
       'JOURNEYS KIDZ #7217 68 OP'], dtype=object)

In [9]:
print(store_sales_df.shape)
store_sales_df[store_sales_df['STORE'] == 1500]

(707904, 4)

        DIV  STORE   STOCKNO  COUNT(*)
518951    8   1500    110036         6
518952    8   1500    110061        12
518953    8   1500    110078        12
518954    8   1500    110081         3
518955    8   1500    110082         6
...     ...    ...       ...       ...
522003    8   1500  99868059         7
522004    8   1500  99869317        77
522005    8   1500  99869319       102
522006    8   1500  99925001         2
522007    8   1500  99925002         4

[3057 rows x 4 columns]

In [10]:
products_df.head()

,DIV,STOCKNO,STYLE_DESCR,BRAND_ID,VENDOR_NUMBER,VENDOR_NAME,COMBINED_BRAND,DEPARTMENT,DEPARTMENT_NAME,MAJOR,MAJOR_NAME,MINOR,MINOR_NAME
0,8,107,HASH,NaN,77311,UNI HOSIERY CO,UNI HOSIERY CO,5,05 - HOSE,80,80 - Hose,8301,8301 - Womens Casuals
1,8,112,HASH,NaN,379400,HUFFMAN FINISHING CO,HUFFMAN FINISHING CO,5,05 - HOSE,80,80 - Hose,8401,8401 - Womens Athletics
2,8,129,DKGREY LOW CUT 5PK,VANS,379400,HUFFMAN FINISHING CO,VANS,5,05 - HOSE,80,80 - Hose,9999,9999 - Web
3,8,131,CASLNR SOFT COLORS SHI 5PK,DR. MARTENS,379400,HUFFMAN FINISHING CO,DR. MARTENS,5,05 - HOSE,80,80 - Hose,9999,9999 - Web
4,8,133,HASH,NaN,135211,SABG-DIVISION OF GCE INTERNATI,SABG-DIVISION OF GCE INTERNATI,5,05 - HOSE,80,80 - Hose,8401,8401 - Womens Athletics

In [11]:
products_df.shape

(29111, 13)

In [12]:
products_df.DEPARTMENT_NAME.unique()

array(['05 - HOSE', '08 - FINDINGS-ACCESSORIES', '15 - SHOE_CARE',
       '09 - KIDZ HOSE', '10 - KIDZ ACCESSORIES', '06 - APPAREL',
       '04 - GIRLS', '03 - WOMENS', '01 - MENS', '02 - BOYS',
       '07 - TODDLERS'], dtype=object)

In [13]:
products_df.MAJOR_NAME.unique()

array(['80 - Hose', '90 - Accessories', '95 - Non Marginal',
       '85 - Findings', '81 - Kidz Hose', '91 - Kidz Accessories',
       '30 - Girls Fashion', '60 - Wom Fashion', '40 - Mens Ath',
       '70 - Wom Ath', '11 - Ath Boys 11-7', '20 - Mens Fashion',
       '45 - Athletic Girls', '21 - Cas Boys 11-7',
       '65 - Toddler Casuals', '55 - Toddler Athl'], dtype=object)

In [14]:
products_df.STYLE_DESCR.value_counts()

HASH                             777
HASH  //  DTC                    108
KENSIE GIRL WESTERN BOOT          16
DSV_CONSOL                        10
CLASSIC WHT                        9
                                ...
TILT BLACK/GREY/RED                1
FUSION BLACK/NIGHT                 1
TILT         BLACK/CARBON/RED      1
CT-IV CLASSIC BLK/WHT/GUM          1
ORG FLEX DECK                      1
Name: STYLE_DESCR, Length: 24620, dtype: int64

In [15]:
products_df[products_df['DEPARTMENT'] == 1]

,DIV,STOCKNO,STYLE_DESCR,BRAND_ID,VENDOR_NUMBER,VENDOR_NAME,COMBINED_BRAND,DEPARTMENT,DEPARTMENT_NAME,MAJOR,MAJOR_NAME,MINOR,MINOR_NAME
4988,8,41886,997H GRY/BLK/WHT,NEW BALANCE,1777,NEW BALANCE ATHLETIC SHOES INC,NEW BALANCE,1,01 - MENS,40,40 - Mens Ath,4302,4302 - New Balance
5929,8,100001,PHANTOM FREE OLIVE,NaN,98080,HURLEY INTERNATIONAL LLC,HURLEY INTERNATIONAL LLC,1,01 - MENS,40,40 - Mens Ath,4501,4501 - Athletic Sandals
5930,8,100002,FUSION GREY,NaN,98080,HURLEY INTERNATIONAL LLC,HURLEY INTERNATIONAL LLC,1,01 - MENS,40,40 - Mens Ath,4501,4501 - Athletic Sandals
5931,8,100004,ONE AND ONLY RASTA,NaN,98080,HURLEY INTERNATIONAL LLC,HURLEY INTERNATIONAL LLC,1,01 - MENS,40,40 - Mens Ath,4501,4501 - Athletic Sandals
5937,8,101908,HASH,NaN,4385,AMTRAT INTERNATIONAL CORP.,AMTRAT INTERNATIONAL CORP.,1,01 - MENS,20,20 - Mens Fashion,2602,2602 - Tommy Hilfiger
...,...,...,...,...,...,...,...,...,...,...,...,...,...
29099,8,99919599,RED A/O BOAT,SPERRY,631,SPERRY TOP-SIDER INC.,SPERRY,1,01 - MENS,20,20 - Mens Fashion,9920,9920 - Direct Mens Fashion
29100,8,99919607,BLK REGATTA FLIP,NaN,631,SPERRY TOP-SIDER INC.,SPERRY TOP-SIDER INC.,1,01 - MENS,20,20 - Mens Fashion,9920,9920 - Direct Mens Fashion
29108,8,99941065,GREY FLEX DECK,SPERRY,631,SPERRY TOP-SIDER INC.,SPERRY,1,01 - MENS,20,20 - Mens Fashion,9920,9920 - Direct Mens Fashion
29109,8,99941067,WHI FLEX DECK,SPERRY,631,SPERRY TOP-SIDER INC.,SPERRY,1,01 - MENS,20,20 - Mens Fashion,9920,9920 - Direct Mens Fashion
29110,8,99941068,ORG FLEX DECK,SPERRY,631,SPERRY TOP-SIDER INC.,SPERRY,1,01 - MENS,20,20 - Mens Fashion,9920,9920 - Direct Mens Fashion

# Analysis

In [16]:
jan_df[['PRIMARY_STOCKNO','SECONDARY_STOCKNO']].value_counts()

PRIMARY_STOCKNO  SECONDARY_STOCKNO
398913           1639                 1278
398564           434                   932
499243           402                   585
398913           398564                556
398564           398913                556
                                      ...
532106           362024                  1
                 362033                  1
                 389030                  1
                 389052                  1
99869319         99794472                1
Length: 228442, dtype: int64

In [17]:
products_df[(products_df['STOCKNO'] == 398913) | (products_df['STOCKNO'] == 1639)]

,DIV,STOCKNO,STYLE_DESCR,BRAND_ID,VENDOR_NUMBER,VENDOR_NAME,COMBINED_BRAND,DEPARTMENT,DEPARTMENT_NAME,MAJOR,MAJOR_NAME,MINOR,MINOR_NAME
195,8,1639,CREP PROTECT,CREP,133322,CREP PROTECT INC,CREP,15,15 - SHOE_CARE,85,85 - Findings,8701,8701 - JY Findings
8252,8,398913,A STAR HI OPT WHT,CONVERSE,154000,CONVERSE,CONVERSE,3,03 - WOMENS,70,70 - Wom Ath,7702,7702 - Chucks Core

I am trying to create a function that when given a stock number it will return the top 3 shoes and top 3 accessories sold with that stock number. Once I have this I can run this on the products table to create 6 new columns. 3 for the 1st, 2nd, and 3rd shoe recomendation, and 3 for the 1st, 2nd, and 3rd acessory recomendation.
<br><br>
I could add to more inputs such as age(adult/kid) and sex(male/female) which would act as filters.

#### Doing some test to see how I can write the function

In [19]:
jan_df[(jan_df == 398913).any(axis=1)]

,DIV,STORE,TRANSACTION_DATE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_EMP_IND,PRIMARY_SOS_IND,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_EMP_IND,SECONDARY_SOS_IND,SECONDARY_UNITS,PRIMARY_LINENO,SECONDARY_LINENO
8,8,11,14-JAN-23,398913,065,M,N,N,1,1639,NaN,NaN,N,N,1,1,2
19,8,11,16-JAN-23,398913,100,M,N,N,1,3018,NaN,NaN,N,N,3,1,3
55,8,11,22-JAN-23,398913,080,M,N,N,1,398564,080,M,N,N,1,1,2
56,8,11,22-JAN-23,398564,080,M,N,N,1,398913,080,M,N,N,1,2,1
64,8,11,27-JAN-23,398913,100,M,N,N,1,1639,NaN,NaN,N,N,1,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
492667,8,7215,26-JAN-23,398913,50,M,N,N,1,1401804,070,M,N,N,1,1,2
492668,8,7215,26-JAN-23,1401804,70,M,N,N,1,398913,050,M,N,N,1,2,1
492795,8,7214,22-JAN-23,398913,40,M,N,N,1,1830,NaN,NaN,N,N,5,1,2
493129,8,7216,29-JAN-23,398913,50,M,N,N,1,4836,NaN,NaN,N,N,1,1,2
493130,8,7216,29-JAN-23,398913,50,M,N,N,1,3164,NaN,NaN,N,N,5,1,3

Given a stock number, return a dataframe with all combinations of that stock number and how many times those combinations were sold

In [50]:
recomendation_df = pd.DataFrame(jan_df[(jan_df['PRIMARY_STOCKNO'] == 398913)][['PRIMARY_STOCKNO','SECONDARY_STOCKNO']]).value_counts().reset_index()
recomendation_df

      PRIMARY_STOCKNO  SECONDARY_STOCKNO     0
0              398913               1639  1278
1              398913             398564   556
2              398913                401   524
3              398913                434   254
4              398913             398732   153
...               ...                ...   ...
1081           398913             398509     1
1082           398913             398530     1
1083           398913             398532     1
1084           398913             398549     1
1085           398913           99850550     1

[1086 rows x 3 columns]

In [52]:
recomendation_df.columns = ['PRIMARY_STOCKNO', 'SECONDARY_STOCKNO', 'COUNT']

In [53]:
recomendation_df

      PRIMARY_STOCKNO  SECONDARY_STOCKNO  COUNT
0              398913               1639   1278
1              398913             398564    556
2              398913                401    524
3              398913                434    254
4              398913             398732    153
...               ...                ...    ...
1081           398913             398509      1
1082           398913             398530      1
1083           398913             398532      1
1084           398913             398549      1
1085           398913           99850550      1

[1086 rows x 3 columns]

Return the top 3 items that are most commonly bought with that stock number

In [41]:
STOCK = 398913

for index, row in recomendation_df.head(10).iterrows():
    if row.SECONDARY_STOCKNO == STOCK:
        print(row.PRIMARY_STOCKNO)
    else:
        print(row.SECONDARY_STOCKNO)

1639
398564
401
434
398732
403
400
99398734
3970
398504

In [22]:
#looking into the returned stock numbers
products_df[(products_df['STOCKNO'] == 1639) | (products_df['STOCKNO'] == 398564) | (products_df['STOCKNO'] == 401)]

,DIV,STOCKNO,STYLE_DESCR,BRAND_ID,VENDOR_NUMBER,VENDOR_NAME,COMBINED_BRAND,DEPARTMENT,DEPARTMENT_NAME,MAJOR,MAJOR_NAME,MINOR,MINOR_NAME
100,8,401,WM/BOY QTR WHT 5PK,JOURNEYS,379400,HUFFMAN FINISHING CO,JOURNEYS,5,05 - HOSE,80,80 - Hose,8401,8401 - Womens Athletics
195,8,1639,CREP PROTECT,CREP,133322,CREP PROTECT INC,CREP,15,15 - SHOE_CARE,85,85 - Findings,8701,8701 - JY Findings
8238,8,398564,A STAR HI BLK/WHT,CONVERSE,154000,CONVERSE,CONVERSE,3,03 - WOMENS,70,70 - Wom Ath,7702,7702 - Chucks Core

I am now joining the DEPARTMENT from the products table to the January sales table so I can filter on accessory or shoe. I will be joining on STOCKNO and PRIMARY_STOCKNO.

In [23]:
jan_sales_department = pd.merge(jan_df, products_df[['STOCKNO','DEPARTMENT']], 
                               left_on = 'PRIMARY_STOCKNO', right_on = 'STOCKNO', 
                               how = 'left')
jan_sales_department.head(3)

,DIV,STORE,TRANSACTION_DATE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_EMP_IND,PRIMARY_SOS_IND,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_EMP_IND,SECONDARY_SOS_IND,SECONDARY_UNITS,PRIMARY_LINENO,SECONDARY_LINENO,STOCKNO,DEPARTMENT
0,8,11,13-JAN-23,860448,070,M,N,N,1,1802406,060,M,N,N,1,1,2,860448.0,3.0
1,8,11,13-JAN-23,1802406,060,M,N,N,1,860448,070,M,N,N,1,2,1,1802406.0,2.0
2,8,11,13-JAN-23,497795,045,M,N,N,1,3323,NaN,NaN,N,N,3,1,3,497795.0,1.0

In [24]:
jan_sales_department = jan_sales_department.rename(columns={"DEPARTMENT": "PRIMARY_DEPT"})

In [25]:
jan_sales_department.head(3)

,DIV,STORE,TRANSACTION_DATE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_EMP_IND,PRIMARY_SOS_IND,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_EMP_IND,SECONDARY_SOS_IND,SECONDARY_UNITS,PRIMARY_LINENO,SECONDARY_LINENO,STOCKNO,PRIMARY_DEPT
0,8,11,13-JAN-23,860448,070,M,N,N,1,1802406,060,M,N,N,1,1,2,860448.0,3.0
1,8,11,13-JAN-23,1802406,060,M,N,N,1,860448,070,M,N,N,1,2,1,1802406.0,2.0
2,8,11,13-JAN-23,497795,045,M,N,N,1,3323,NaN,NaN,N,N,3,1,3,497795.0,1.0

Doing the same thing but for SECONDARY_STOCKNO

In [26]:
jan_sales_departments = pd.merge(jan_sales_department, products_df[['STOCKNO','DEPARTMENT']], 
                               left_on = 'SECONDARY_STOCKNO', right_on = 'STOCKNO', 
                               how = 'left')
jan_sales_departments.head(3)

,DIV,STORE,TRANSACTION_DATE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_EMP_IND,PRIMARY_SOS_IND,PRIMARY_UNITS,SECONDARY_STOCKNO,...,SECONDARY_ITEM_WIDTH,SECONDARY_EMP_IND,SECONDARY_SOS_IND,SECONDARY_UNITS,PRIMARY_LINENO,SECONDARY_LINENO,STOCKNO_x,PRIMARY_DEPT,STOCKNO_y,DEPARTMENT
0,8,11,13-JAN-23,860448,070,M,N,N,1,1802406,...,M,N,N,1,1,2,860448.0,3.0,1802406.0,2.0
1,8,11,13-JAN-23,1802406,060,M,N,N,1,860448,...,M,N,N,1,2,1,1802406.0,2.0,860448.0,3.0
2,8,11,13-JAN-23,497795,045,M,N,N,1,3323,...,NaN,N,N,3,1,3,497795.0,1.0,3323.0,5.0

Dropping some columns

In [27]:
jan_sales_departments = jan_sales_departments.drop(columns = ['TRANSACTION_DATE', 'PRIMARY_EMP_IND',
                                                              'SECONDARY_EMP_IND', 'PRIMARY_SOS_IND',
                                                              'SECONDARY_SOS_IND', 'PRIMARY_LINENO',
                                                              'SECONDARY_LINENO', 'STOCKNO_x',
                                                              'STOCKNO_y' ])

In [28]:
jan_sales_departments = jan_sales_departments.rename(columns={"DEPARTMENT": "SECONDARY_DEPT"})

In [29]:
jan_sales_departments.head(5)

,DIV,STORE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_UNITS,PRIMARY_DEPT,SECONDARY_DEPT
0,8,11,860448,070,M,1,1802406,060,M,1,3.0,2.0
1,8,11,1802406,060,M,1,860448,070,M,1,2.0,3.0
2,8,11,497795,045,M,1,3323,NaN,NaN,3,1.0,5.0
3,8,11,581620,080,M,1,2577,NaN,NaN,3,3.0,5.0
4,8,11,581620,080,M,1,53080,M,NaN,1,3.0,6.0

Creating a new column PRIMARY_SHOE (True or False)

In [30]:

for index, row in jan_sales_departments.iterrows():
    if row.PRIMARY_DEPT in [1, 2, 3, 4, 7]:
        jan_sales_departments.loc[index, 'PRIMARY_SHOE'] = 'True'
    elif row.PRIMARY_DEPT in [5, 6, 8, 9, 10, 15]:
        jan_sales_departments.loc[index, 'PRIMARY_SHOE'] = 'False'
    else:
        jan_sales_departments.loc[index, 'PRIMARY_SHOE'] = 'error'

In [31]:
jan_sales_departments.head(3)

,DIV,STORE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_UNITS,PRIMARY_DEPT,SECONDARY_DEPT,PRIMARY_SHOE
0,8,11,860448,070,M,1,1802406,060,M,1,3.0,2.0,True
1,8,11,1802406,060,M,1,860448,070,M,1,2.0,3.0,True
2,8,11,497795,045,M,1,3323,NaN,NaN,3,1.0,5.0,True

Creating a new column SECONDARY_SHOE (True or False)

In [32]:
for index, row in jan_sales_departments.iterrows():
    if row.SECONDARY_DEPT in [1, 2, 3, 4, 7]:
        jan_sales_departments.loc[index, 'SECONDARY_SHOE'] = 'True'
    elif row.SECONDARY_DEPT in [5, 6, 8, 9, 10, 15]:
        jan_sales_departments.loc[index, 'SECONDARY_SHOE'] = 'False'
    else:
        jan_sales_departments.loc[index, 'SECONDARY_SHOE'] = 'error'

In [33]:
jan_sales_departments.head(3)

,DIV,STORE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_UNITS,PRIMARY_DEPT,SECONDARY_DEPT,PRIMARY_SHOE,SECONDARY_SHOE
0,8,11,860448,070,M,1,1802406,060,M,1,3.0,2.0,True,True
1,8,11,1802406,060,M,1,860448,070,M,1,2.0,3.0,True,True
2,8,11,497795,045,M,1,3323,NaN,NaN,3,1.0,5.0,True,False

Creating a table for shoes sold with shoes (jan_shoe_shoe), and shoes sold with accessories (jan_shoe_acces)

In [34]:
jan_shoe_shoe = jan_sales_departments[(jan_sales_departments['SECONDARY_SHOE'] == 'True') 
                                      & (jan_sales_departments['PRIMARY_SHOE'] == 'True')]

jan_shoe_acces = jan_sales_departments[(jan_sales_departments['SECONDARY_SHOE'] == 'False')
                                      & (jan_sales_departments['PRIMARY_SHOE'] == 'True')]

### The following functions are used to find the top 3 shoe or accessory recomendations given a shoe's stock number. The first list contains the recomendations. The second list returns the amount of times this combonation has been purchased.

In [67]:
def shoe_recomendations(stock_num):
    
    recomendation_df = pd.DataFrame(jan_shoe_shoe[(jan_shoe_shoe['PRIMARY_STOCKNO'] == stock_num)]
                                    [['PRIMARY_STOCKNO','SECONDARY_STOCKNO']]).value_counts().reset_index()
    
    recomendation_df.columns = ['PRIMARY_STOCKNO', 'SECONDARY_STOCKNO', 'COUNT']
    
    recomendations = []
    combo_purchase_count = []
    
    for index, row in recomendation_df.head(3).iterrows():
        if row.SECONDARY_STOCKNO == stock_num:
            recomendations.append(row.PRIMARY_STOCKNO)
            combo_purchase_count.append(row.COUNT)
        else:
            recomendations.append(row.SECONDARY_STOCKNO)
            combo_purchase_count.append(row.COUNT)
    
    return recomendations, combo_purchase_count

In [68]:
shoe_recomendations(398913)

([398564, 398732, 99398734], [556, 153, 117])

In [69]:
def acces_recomendation(stock_num):
    
    recomendation_df = pd.DataFrame(jan_shoe_acces[(jan_shoe_acces['PRIMARY_STOCKNO'] == stock_num)]
                                    [['PRIMARY_STOCKNO','SECONDARY_STOCKNO']]).value_counts().reset_index()
    
    recomendation_df.columns = ['PRIMARY_STOCKNO', 'SECONDARY_STOCKNO', 'COUNT']
    
    recomendations = []
    combo_purchase_count = []
    
    for index, row in recomendation_df.head(3).iterrows():
        if row.SECONDARY_STOCKNO == stock_num:
            recomendations.append(row.PRIMARY_STOCKNO)
            combo_purchase_count.append(row.COUNT)
        else:
            recomendations.append(row.SECONDARY_STOCKNO)
            combo_purchase_count.append(row.COUNT)
    
    return recomendations, combo_purchase_count

In [70]:
acces_recomendation(398913)

([1639, 401, 434], [1278, 524, 254])

### I want to be able to filter on location hierarchy so I am joining the stores table to the sales table using 'store'. I am also merging all the sales tables (nov. ,dec., and jan.) into one df called sales_df.

In [65]:
sales_df = pd.concat([nov_df, dec_df, jan_df])
sales_df.head(3)

,DIV,STORE,TRANSACTION_DATE,PRIMARY_STOCKNO,PRIMARY_ITEM_SIZE,PRIMARY_ITEM_WIDTH,PRIMARY_EMP_IND,PRIMARY_SOS_IND,PRIMARY_UNITS,SECONDARY_STOCKNO,SECONDARY_ITEM_SIZE,SECONDARY_ITEM_WIDTH,SECONDARY_EMP_IND,SECONDARY_SOS_IND,SECONDARY_UNITS,PRIMARY_LINENO,SECONDARY_LINENO
0,8,12,02-NOV-22,99497860,080,M,N,Y,1,497403,060,M,N,N,1,1,3
1,8,12,02-NOV-22,497403,060,M,N,N,1,99497860,080,M,N,Y,1,3,1
2,8,12,03-NOV-22,398562,100,M,N,N,1,19133,XL,NaN,N,N,1,2,1